01  WS-AREA. 
    05  WS-COUNT PIC 9(5) VALUE 0. 
    05  WS-TABLE OCCURS 100 TIMES INDEXED BY WS-INDEX. 
       10  WS-TABLE-ENTRY PIC X(80). 

PROCEDURE DIVISION. 
    PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 100 
       MOVE 'Record ' & WS-INDEX TO WS-TABLE-ENTRY(WS-INDEX) 
    END-PERFORM. 

    DISPLAY 'Table populated.' 
    STOP RUN.